{"PMR_DATA":"Please verify entitlement CompId and if its necessary contact customer In case CompID should be changed, please run re-entitlement If entitlement is OK continue withsupport If entitlement is not OK inform customer about exception PMR and sendPMR to appropriate Entitlement Exception queue For acquisition products please see correct exception queue in the following document LPAR unexpectedly increase swap usage at that time seen not allocated half of the RAM instead of 196 Gb i saw only 65 Gb.The problem was solved by power offpower on LPAR. Customer ask RCA.AT Ask for snap dump and clarify check ASM memory on HMC There is no dump in snap Wrote to customer about this. Also i tried understend why lpar hang and was rebooted. Deiscribed errors in errpt sent link how to turn on snap Name of contact person Yalkun Mametsupiyev Positive feedback Yes Feedback by mail Client feedback comments Thanks for consultation. Please close PMR"}
{"PMR_DATA":"Hello Asked details of the issue as we dont have any problem description.Waiting feedback from customer. This is a duplicate for the main PMR 00346,SGC,694 Ill close this PMR with DUPDNS. Customer informed. Name of contact person YALKUN MAMETSUPIEV Positive feedback Feedback by mail Client feedback comments:This is a duplicate for the main PMR 00346,SGC,694 I ll close this PMR with DUPDNS.Customer informed."}
{"PMR_DATA":"ELEMENTS OF CALL CLOSURE Did you ask if you have answered their questions to their satisfaction or if there was anything else that you could help them with y Did you ask if you may go ahead and close their call Did you thank them for calling IBM Customer: Satish Gandi  Contact Phone: 401-772-2898 Problem System keep rebooting every 2 mins. Action Taken Cust stated that system keep rebooting, after reboot he can loging fine, but withing 1-2 mins it start reboot again. Cust collected errpt output, and send to me. Below is the errpt report. Looks like there some sysplanar errors in errpt. so collab with HW to rule out, that sysplanar errors. Action Plan: colb with HW Action Taken Cust is not able to capture the complete errpt output as the sytem start reboot again. So we do not get detail of sysplanar0 errors but get init error output..Description SOFTWARE PROGRAM ERROR Probable Causes SOFTWARE PROGRAM User Causes PERFORMANCE DEGRADED  Recommended Actions REVIEW DETAILED DATA Detail Data SOFTWARE ERROR CODE Command is respawning too rapidly. Check for possible errors. COMMAND id  disc opt HPmon Discovery bin discagnt Told cust to go to maint mode and do barebone init and reboot. Email cust below link..Cust tried to boot in mm and could not find inittab file in etc. Told cust that there is a template inittab file below location, he can copy it to etc and reboot the system. But he said, he wants escalation at this point, as it is their prod system and need to handover the server to cust. paged to LVM,308 for assistance. Action Taken Cu called back. Had Cu boot to maintenance mode, choose to access rootvg and start a shell option 1, backup inittab file, then copy inittab template file to . Then reboot came up, stayed up, and didnt crash. So, something in his inittab causing the problem. He copied inittab from another cluster system and got crash. Asked Cu to collect and submit snap gktc.Cu determined the problem lines in inittab... I have commented out the below lines in inittab file, now the server running good.Please hold on the PMR for next 2 days.Action taken TC has arrvied. Action Taken Note request to hold PMR. Action Plan Update secondary, lpwo"}
{"PMR_DATA":"Problem title no ro fails.Problem description DR p784kdc no ro ipsrcrouteforward 0 no 1485-122 Error writing ipsrcrouteforward in nextboot file Unable to run commands as expected received this email from customer. Looks like it worked, whats the secret Setting icmpaddressmask to 0 in nextboot file Warning changes will take effect only at next reboot Philip Sack I responded with this  email. Philip lppch  -ul  updates the   new  check  sum   in   Software Vital Product Data  (swpd) database . Since  there was difference in  fileset levels  it was necessary  to   update this information. Also  the file set  may  have  been   installed  in Common Criteria Mode.   In this move  the  filse bos,perf.tune  have their executable rights  removed for security  purposes.   The set_phase command was  used to restore the execution  permissions. If you have no  further concerns questions then  this  PMR needs to  be closed.On behalf of IBM Software Remote Technical Support, it has been my pleasure to work with youregarding your no issue settingtunables in nextboot service request.  Customer satisfaction feedback is key to us maintaining the highest service levels for our customers. IBMs support team is committed to ensuring that you are very satisfied and assisting you in obtaining the highest value from our products and services.  If you require additional assistance on PMR 00972,l6q the problem can be easily reopened within the next twenty-eight days. Please call 800-IBM-SERV for issues outside of this PMR as this email address may not be monitored and a reply is not guaranteed. Thank you for using IBM."}
{"PMR":"00979,SGC,704","PMR_DATA":"On 01.02. we made an AIX OS upgrade from 7.1 TL1 SP6 oslevel 7100-01-06-1241 to  version 7100-03-03-1415.This is our production load balancing edge server, so we made a new installation of edge server WAS LB 8.5.5.3. and  everything was working fine. Server synchronized with another standby edge server which is on older version of AIX 710001061241, and WAS LB 8.0.0.2.But yesterday 03.02 at 15:10h  server rebooted at once. We got these errpt messagesOther standby edge server (which is on older verison of aix 7100-01-06-1241 tookover so we didint have problems with our production envirnomnet.This is our primary load balancing server and it could be a big buisness impact for us if these server reboots start to happen more often This is big problem for us because we are in middle of upgrading. We need your help ASAP.In attachment I uploaded, minidump and logs Note This lpar is installed on machine where is dual VIOS envirnment with HEA  ethernet cards.Business impact  BusImpact  This is our primary load balancing server and it could be a big buisness impact for us if these server reboots start to happen more often.This is big problem for us because we are in middle of upgrading. We need your help ASAP. Could you check the entitlement of this call Thank you for your help! It uses CPU share pool.At the moment when problem occur it was Processing units Min 0,1 , Desired 0.4 but after problem occur i reduce it to 0,2 which is standard value in cofngiuration for this server, Maximum 1 Virtual processors Min 1 , Desired 1 , Maximum 2 My name is Hanife, I will be assisting you on this dump issue. I did check snap data but unfortunately dump .BZ file is missing . I could  not be sure about why this file missing in snap . Since the dump is completed with success, I expect to have it in snap. Please let me know, if this file is removed manually from snap collection. If not, please execute snap -r and snap -D one more time and upload it once more .I will be waiting for dump data for analysis. File isnt removed manually from snap collection. I dont what happened But I made another snap I check file dump.BZ is in it and uploaded it threw http, file name is 00979.SGC.704.snap-D.tar .But after going thru ibmlb, we got wrong mbuf flags.So this is a problem with ibmlb kernel extension, most probably because LB is not properly setting the mbuf. Some similar pmrs turned out to be a problem with LB when the underlying adapters use large send, which is the case.So as a circumvention customer can disable large send, especially about ent0 ent2 composing ent4 EtherChannel, which this dump was about.But all in all customer should further check with his IBM Edge Load Balance support. Were aware that You are working on this issue  we are following the development.Is there any new information or feedback from WAS edge LB support team  Notes After reboot, we put this server in production mode active edge lbserver, because we want to test if this problem going to happen again.We have standby edge lb server which is on old version of AIX & WAS LB,if something goes wrong.Also we have server's mksysb, before upgrade, which we can restore back.But we wouldnt like to do that if it isnt necessary.Any information would be helpful to know what we can expect next. it is good to hear that you did not have the issue again after chnages until now. Lets wait some more time to be sure. For the cpu usage increase, if you think that you have an issue related to cpu usage, I will please you to open a new pmr for perfpmr analysis.But you should  collect perfpmr data while HAVING issue. high cpu usage I will taking this case to stby for 10 days. Please update us, if you will have a crash issue ."}
